app/views/owners/show.html.erb

SELECT "units".* FROM "units" WHERE "units"."owner_id" = $1  [["owner_id", 115]]
---
<ul>
  <% @owner.units.each do |unit| %>